---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCLinkDocumentExportScope.Dispose
source: html/c772673e-9692-88f9-453e-f639395e20ec.htm
---
# Autodesk.Revit.DB.IFC.IFCLinkDocumentExportScope.Dispose Method

Releases all resources used by the IFCLinkDocumentExportScope

## Syntax (C#)
```csharp
public void Dispose()
```